  import random
  HANGMANPICS = ['''
    +---+
    |   |
        |
        |
        |
        |
 =========''','''
    +---+
    |   |
    O   |
        |
        |
        |
 =========''','''
    +---+
    |   |
    O   |
    |   |
        |
        |
 =========''','''
    +---+
    |   |
    O   |
   /|   |
        |
        |
 =========''','''
    +---+
    |   |
    O   |
   /|\  |
        |
        |
 =========''','''
    +---+
    |   |
    O   |
   /|\  |
   /    |
        |
 =========''','''
    +---+
    |   |
    O   |
   /|\  |
   / \  |
        |
 =========''']
 words = 'муравей бабуин барсук медведь бобр верблюд кошка моллюск кобра пума койот ворона олень собака осел утка орел хорек лиса лягушка коза гусь ястреб ящерица лама моль обезьяна лось мышь мул тритон выдра сова панда попугай голубь питон кролик баран крыса носорог лосось акула змея паук аист лебедь тигр жаба форель индейка черепаха ласка кит волк вомбат зебра'.split()